cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
//===-- AVR32 TargetInfo tests -------------------------------------------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//

#include "llvm/BinaryFormat/ELF.h"
#include "MCTargetDesc/AVR32MCTargetDesc.h"
#include "llvm/MC/MCAsmBackend.h"
#include "llvm/MC/MCAsmInfo.h"
#include "llvm/MC/MCCodeEmitter.h"
#include "llvm/MC/MCContext.h"
#include "llvm/MC/MCELFObjectWriter.h"
#include "llvm/MC/MCFixup.h"
#include "llvm/MC/MCInst.h"
#include "llvm/MC/MCInstrInfo.h"
#include "llvm/MC/MCInstPrinter.h"
#include "llvm/MC/MCObjectFileInfo.h"
#include "llvm/MC/MCObjectWriter.h"
#include "llvm/MC/MCParser/MCAsmParser.h"
#include "llvm/MC/MCParser/MCTargetAsmParser.h"
#include "llvm/MC/MCRegisterInfo.h"
#include "llvm/MC/MCStreamer.h"
#include "llvm/MC/MCSubtargetInfo.h"
#include "llvm/MC/MCTargetOptions.h"
#include "llvm/MC/TargetRegistry.h"
#include "llvm/Support/MemoryBuffer.h"
#include "llvm/Support/SourceMgr.h"
#include "llvm/Support/TargetSelect.h"
#include "llvm/Support/raw_ostream.h"
#include "llvm/Target/TargetMachine.h"
#include "llvm/TargetParser/Triple.h"
#include "gtest/gtest.h"
#include <optional>
#include <string>

using namespace llvm;

namespace {

TEST(AVR32TargetInfo, LookupTarget) {
  LLVMInitializeAVR32TargetInfo();
  LLVMInitializeAVR32TargetMC();
  LLVMInitializeAVR32AsmParser();

  Triple TT("avr32-unknown-unknown");
  std::string Error;
  const Target *TheTarget = TargetRegistry::lookupTarget(TT, Error);

  ASSERT_NE(TheTarget, nullptr) << Error;
  EXPECT_EQ(TheTarget->getName(), StringRef("avr32"));

  std::unique_ptr<TargetMachine> TM(TheTarget->createTargetMachine(
      TT, "", "", TargetOptions(), std::nullopt));
  EXPECT_EQ(TM.get(), nullptr);

  std::unique_ptr<MCRegisterInfo> MRI(TheTarget->createMCRegInfo(TT));
  ASSERT_NE(MRI.get(), nullptr);

  MCTargetOptions Options;
  std::unique_ptr<MCAsmInfo> MAI(
      TheTarget->createMCAsmInfo(*MRI, TT, Options));
  ASSERT_NE(MAI.get(), nullptr);
  EXPECT_EQ(MAI->getCodePointerSize(), 4u);
  EXPECT_EQ(MAI->getCommentString(), StringRef("#"));

  std::unique_ptr<MCInstrInfo> MII(TheTarget->createMCInstrInfo());
  ASSERT_NE(MII.get(), nullptr);
  EXPECT_EQ(MII->get(AVR32::NOP).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ACALLi).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ADCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ABSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ACRr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ADDABSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDALrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDCCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDCSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDEQrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDGErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDGTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDHIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDHSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDLErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDLOrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDLSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDLTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDMIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDNErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDPLrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDQSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDVCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDVSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ADDrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ANDHri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDHri_COH).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDLri_COH).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDALrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDCCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDCSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDEQrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDGErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDGTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDHIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDHSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDLErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDLOrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDLSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDLTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDMIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDNErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDPLrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDQSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDVCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDVSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ANDNrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ANDrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ASRrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::BLDri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::BREVr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::BSTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::BREAKPOINT).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CBRri).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CASTS_Br).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CASTS_Hr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CASTU_Br).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CASTU_Hr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CLZrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::COMr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CPCr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CPCrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::CP_Brr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::CP_Hrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::CP_Wri21).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::CP_Wri6).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CP_Wrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CSRFCZi).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::CSRFi).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::DIVSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::DIVUrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORHri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORALrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORCCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORCSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EOREQrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORGErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORGTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORHIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORHSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORLErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORLOrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORLSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORLTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORMIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORNErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORPLrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORQSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORVCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORVSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::EORrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::FRS).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ICALLr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::INCJOSPi).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::LSLrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::LSRrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MAXrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MINrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MFDRi).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MFSRi).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVALri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVCCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVCSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVEQri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVGEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVGTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVHIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVHSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLOri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVMIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVNEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVPLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVQSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVVCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVVSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVALrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVCCrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVCSrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVEQrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVGErr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVGTrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVHIrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVHSrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLErr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLOrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLSrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVLTrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVMIrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVNErr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVPLrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVQSrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVVCrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVVSrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVri8).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::MOVri21).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MOVHri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MULrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::MULri8).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MULrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MULS_Drrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MULU_Drrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MUSFRr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::MUSTRr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::MTDRi).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::MTSRi).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::NEGr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ORHri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORALrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORCCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORCSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::OREQrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORGErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORGTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORHIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORHSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORLErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORLOrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORLSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORLTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORMIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORNErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORPLrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORQSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORVCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORVSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ORrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::POPJC).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::PUSHJC).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETD).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETE).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETALr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETCCr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETCSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETEQr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETGEr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETGTr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETHIr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETHSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETLEr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETLOr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETLSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETLTr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETMIr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETNEr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETPLr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETQSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETVCr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETVSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETJ).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETS).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RETSS).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ROLr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RORr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::RSUBALri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBCCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBCSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBEQri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBGEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBGTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBHIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBHSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBLEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBLOri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBLSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBLTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBMIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBNEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBPLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBQSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBVCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBVSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::RSUBrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SATADD_Wrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SATRNDSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SATRNDUri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SATSUB_Hrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SATSUB_Wrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SATSUB_Wrri16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SATSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SATUri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SBCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SBRri).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SCALL).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SSCALL).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SCRr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SLEEPi).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SRALr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRCCr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRCSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SREQr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRGEr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRGTr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRHIr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRHSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRLEr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRLOr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRLSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRLTr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRMIr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRNEr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRPLr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRQSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRVCr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SRVSr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SSRFi).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_B_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_B_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_B_Disp3).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_B_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_B_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_D_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_D_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_D_Reg).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_D_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_D_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_H_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_H_Disp3).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_H_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_H_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_PostInc).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_W_PreDec).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_W_Disp4).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::ST_W_Disp16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_AL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_EQ_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_NE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_CC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_HS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_CS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LO_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_GE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_MI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_PL_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_GT_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_LE_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_HI_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_VS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_VC_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::ST_W_QS_Disp9).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STCOND).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STDSP).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::STHH_W_Disp8).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STHH_W_IndexShift).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STSWP_H_Disp12).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::STSWP_W_Disp12).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBALrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBEQrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLOrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLTrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBMIrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBNErrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBPLrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBQSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVCrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVSrrr).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBALri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBCSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBEQri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBGTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBHSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLOri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBLTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBMIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBNEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBPLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBQSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBVSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFALri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFCCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFCSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFEQri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFGEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFGTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFHIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFHSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLOri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFLTri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFMIri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFNEri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFPLri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFQSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFVCri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBFVSri).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBSPri8).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SUBri8).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SUBrrrs).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBrri16).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBri21).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::SUBrr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SWAP_BHr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SWAP_Br).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SWAP_Hr).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::SYNCi).getSize(), 4u);
  EXPECT_EQ(MII->get(AVR32::TLBR).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::TLBS).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::TLBW).getSize(), 2u);
  EXPECT_EQ(MII->get(AVR32::TNBZr).getSize(), 2u);
