cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Csrf, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x13);

  MCInst Neg;
  Neg.setOpcode(AVR32::NEGr);
  Neg.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Neg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5c);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst Eor;
  Eor.setOpcode(AVR32::EORrr);
  Eor.addOperand(MCOperand::createReg(AVR32::R1));
  Eor.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Eor, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x51);

  MCInst Eorh;
  Eorh.setOpcode(AVR32::EORHri);
  Eorh.addOperand(MCOperand::createReg(AVR32::R1));
  Eorh.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Eorh, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xee);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Eorl;
  Eorl.setOpcode(AVR32::EORLri);
  Eorl.addOperand(MCOperand::createReg(AVR32::R1));
  Eorl.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Eorl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xec);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst EorEq;
  EorEq.setOpcode(AVR32::EOREQrrr);
  EorEq.addOperand(MCOperand::createReg(AVR32::R1));
  EorEq.addOperand(MCOperand::createReg(AVR32::R2));
  EorEq.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(EorEq, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst EorAl;
  EorAl.setOpcode(AVR32::EORALrrr);
  EorAl.addOperand(MCOperand::createReg(AVR32::R1));
  EorAl.addOperand(MCOperand::createReg(AVR32::R2));
  EorAl.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(EorAl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Frs;
  Frs.setOpcode(AVR32::FRS);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Frs, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x43);

  MCInst Incjosp;
  Incjosp.setOpcode(AVR32::INCJOSPi);
  Incjosp.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Incjosp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf3);

  MCInst Icall;
  Icall.setOpcode(AVR32::ICALLr);
  Icall.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Icall, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5d);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);

  MCInst Lsl;
  Lsl.setOpcode(AVR32::LSLrrr);
  Lsl.addOperand(MCOperand::createReg(AVR32::R1));
  Lsl.addOperand(MCOperand::createReg(AVR32::R2));
  Lsl.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lsl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x09);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Lsr;
  Lsr.setOpcode(AVR32::LSRrrr);
  Lsr.addOperand(MCOperand::createReg(AVR32::R1));
  Lsr.addOperand(MCOperand::createReg(AVR32::R2));
  Lsr.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lsr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0a);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Max;
  Max.setOpcode(AVR32::MAXrrr);
  Max.addOperand(MCOperand::createReg(AVR32::R1));
  Max.addOperand(MCOperand::createReg(AVR32::R2));
  Max.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Max, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0c);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Min;
  Min.setOpcode(AVR32::MINrrr);
  Min.addOperand(MCOperand::createReg(AVR32::R1));
  Min.addOperand(MCOperand::createReg(AVR32::R2));
  Min.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Min, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0d);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Mfdr;
  Mfdr.setOpcode(AVR32::MFDRi);
  Mfdr.addOperand(MCOperand::createReg(AVR32::R1));
  Mfdr.addOperand(MCOperand::createImm(4));

