cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst StWAlDisp9;
  StWAlDisp9.setOpcode(AVR32::ST_W_AL_Disp9);
  StWAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StWAlDisp9.addOperand(MCOperand::createImm(12));
  StWAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xfa);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst Stcond;
  Stcond.setOpcode(AVR32::STCOND);
  Stcond.addOperand(MCOperand::createReg(AVR32::R1));
  Stcond.addOperand(MCOperand::createImm(-1));
  Stcond.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stcond, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x72);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst Stdsp;
  Stdsp.setOpcode(AVR32::STDSP);
  Stdsp.addOperand(MCOperand::createReg(AVR32::SP));
  Stdsp.addOperand(MCOperand::createImm(12));
  Stdsp.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stdsp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst SthhWDisp8;
  SthhWDisp8.setOpcode(AVR32::STHH_W_Disp8);
  SthhWDisp8.addOperand(MCOperand::createReg(AVR32::R1));
  SthhWDisp8.addOperand(MCOperand::createImm(12));
  SthhWDisp8.addOperand(MCOperand::createReg(AVR32::R2));
  SthhWDisp8.addOperand(MCOperand::createImm(1));
  SthhWDisp8.addOperand(MCOperand::createReg(AVR32::R3));
  SthhWDisp8.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SthhWDisp8, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst SthhWIndexShift;
  SthhWIndexShift.setOpcode(AVR32::STHH_W_IndexShift);
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R4));
  SthhWIndexShift.addOperand(MCOperand::createImm(3));
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  SthhWIndexShift.addOperand(MCOperand::createImm(1));
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  SthhWIndexShift.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SthhWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xa4);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst StswpHDisp12;
  StswpHDisp12.setOpcode(AVR32::STSWP_H_Disp12);
  StswpHDisp12.addOperand(MCOperand::createReg(AVR32::R1));
  StswpHDisp12.addOperand(MCOperand::createImm(-2));
  StswpHDisp12.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StswpHDisp12, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x9f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst StswpWDisp12;
  StswpWDisp12.setOpcode(AVR32::STSWP_W_Disp12);
  StswpWDisp12.addOperand(MCOperand::createReg(AVR32::R1));
  StswpWDisp12.addOperand(MCOperand::createImm(-4));
  StswpWDisp12.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StswpWDisp12, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst Scall;
  Scall.setOpcode(AVR32::SCALL);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Scall, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x33);

  MCInst Sscall;
  Sscall.setOpcode(AVR32::SSCALL);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Sscall, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x53);

  MCInst Scr;
  Scr.setOpcode(AVR32::SCRr);
  Scr.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Scr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5c);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);

  MCInst SrEq;
  SrEq.setOpcode(AVR32::SREQr);
  SrEq.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SrEq, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5f);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);

  MCInst SrAl;
  SrAl.setOpcode(AVR32::SRALr);
  SrAl.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SrAl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5f);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);

  MCInst Sleep;
  Sleep.setOpcode(AVR32::SLEEPi);
  Sleep.addOperand(MCOperand::createImm(1));

