cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Sleep, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x60);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Ssrf;
  Ssrf.setOpcode(AVR32::SSRFi);
  Ssrf.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ssrf, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x13);

  MCInst Sub;
  Sub.setOpcode(AVR32::SUBrr);
  Sub.addOperand(MCOperand::createReg(AVR32::R1));
  Sub.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Sub, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);

  MCInst SubImm8;
  SubImm8.setOpcode(AVR32::SUBri8);
  SubImm8.addOperand(MCOperand::createReg(AVR32::R1));
  SubImm8.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubImm8, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x2f);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);

  MCInst SubSPImm8;
  SubSPImm8.setOpcode(AVR32::SUBSPri8);
  SubSPImm8.addOperand(MCOperand::createReg(AVR32::SP));
  SubSPImm8.addOperand(MCOperand::createImm(-4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubSPImm8, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x2f);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xfd);

  MCInst SubShift;
  SubShift.setOpcode(AVR32::SUBrrrs);
  SubShift.addOperand(MCOperand::createReg(AVR32::R1));
  SubShift.addOperand(MCOperand::createReg(AVR32::R2));
  SubShift.addOperand(MCOperand::createReg(AVR32::R3));
  SubShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst SubRegImm16;
  SubRegImm16.setOpcode(AVR32::SUBrri16);
  SubRegImm16.addOperand(MCOperand::createReg(AVR32::R1));
  SubRegImm16.addOperand(MCOperand::createReg(AVR32::R2));
  SubRegImm16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubRegImm16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst SubImm;
  SubImm.setOpcode(AVR32::SUBri21);
  SubImm.addOperand(MCOperand::createReg(AVR32::R1));
  SubImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xfe);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst SubEq;
  SubEq.setOpcode(AVR32::SUBEQrrr);
  SubEq.addOperand(MCOperand::createReg(AVR32::R1));
  SubEq.addOperand(MCOperand::createReg(AVR32::R2));
  SubEq.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubEq, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

  MCInst SubAl;
  SubAl.setOpcode(AVR32::SUBALrrr);
  SubAl.addOperand(MCOperand::createReg(AVR32::R1));
  SubAl.addOperand(MCOperand::createReg(AVR32::R2));
  SubAl.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubAl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

  MCInst SubEqImm;
  SubEqImm.setOpcode(AVR32::SUBEQri);
  SubEqImm.addOperand(MCOperand::createReg(AVR32::R1));
  SubEqImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubEqImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst SubAlImm;
  SubAlImm.setOpcode(AVR32::SUBALri);
  SubAlImm.addOperand(MCOperand::createReg(AVR32::R1));
  SubAlImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubAlImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst SubfEqImm;
  SubfEqImm.setOpcode(AVR32::SUBFEQri);
  SubfEqImm.addOperand(MCOperand::createReg(AVR32::R1));
  SubfEqImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SubfEqImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst SubfAlImm;
  SubfAlImm.setOpcode(AVR32::SUBFALri);
  SubfAlImm.addOperand(MCOperand::createReg(AVR32::R1));
  SubfAlImm.addOperand(MCOperand::createImm(-1));

