cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst MovImm;
  MovImm.setOpcode(AVR32::MOVri8);
  MovImm.addOperand(MCOperand::createReg(AVR32::R1));
  MovImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MovImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x3f);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf1);

  MCInst MovImm21;
  MovImm21.setOpcode(AVR32::MOVri21);
  MovImm21.addOperand(MCOperand::createReg(AVR32::R1));
  MovImm21.addOperand(MCOperand::createImm(32));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MovImm21, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x61);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x20);

  MCInst Movh;
  Movh.setOpcode(AVR32::MOVHri);
  Movh.addOperand(MCOperand::createReg(AVR32::R1));
  Movh.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Movh, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xfc);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  std::unique_ptr<MCInstPrinter> InstPrinter(
      TheTarget->createMCInstPrinter(TT, /*SyntaxVariant=*/0, *MAI, *MII,
                                     *MRI));
  ASSERT_NE(InstPrinter.get(), nullptr);

  std::string Printed;
  raw_string_ostream OS(Printed);
  InstPrinter->printInst(&Nop, /*Address=*/0, /*Annot=*/"", *STI, OS);
  OS.flush();
  EXPECT_EQ(Printed, "\tnop");

  Printed.clear();
  raw_string_ostream AbsOS(Printed);
  InstPrinter->printInst(&Abs, /*Address=*/0, /*Annot=*/"", *STI, AbsOS);
  AbsOS.flush();
  EXPECT_EQ(Printed, "\tabs\tr1");

  Printed.clear();
  raw_string_ostream AcrOS(Printed);
  InstPrinter->printInst(&Acr, /*Address=*/0, /*Annot=*/"", *STI, AcrOS);
  AcrOS.flush();
  EXPECT_EQ(Printed, "\tacr\tr1");

  Printed.clear();
  raw_string_ostream ACallOS(Printed);
  InstPrinter->printInst(&ACall, /*Address=*/0, /*Annot=*/"", *STI, ACallOS);
  ACallOS.flush();
  EXPECT_EQ(Printed, "\tacall\t4");

  Printed.clear();
  raw_string_ostream AdcOS(Printed);
  InstPrinter->printInst(&Adc, /*Address=*/0, /*Annot=*/"", *STI, AdcOS);
  AdcOS.flush();
  EXPECT_EQ(Printed, "\tadc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AddAbsOS(Printed);
  InstPrinter->printInst(&AddAbs, /*Address=*/0, /*Annot=*/"", *STI,
                         AddAbsOS);
  AddAbsOS.flush();
  EXPECT_EQ(Printed, "\taddabs\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AddOS(Printed);
  InstPrinter->printInst(&Add, /*Address=*/0, /*Annot=*/"", *STI, AddOS);
  AddOS.flush();
  EXPECT_EQ(Printed, "\tadd\tr1, r2");

  Printed.clear();
  raw_string_ostream AddEqOS(Printed);
  InstPrinter->printInst(&AddEq, /*Address=*/0, /*Annot=*/"", *STI, AddEqOS);
  AddEqOS.flush();
  EXPECT_EQ(Printed, "\taddeq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AddAlOS(Printed);
  InstPrinter->printInst(&AddAl, /*Address=*/0, /*Annot=*/"", *STI, AddAlOS);
  AddAlOS.flush();
  EXPECT_EQ(Printed, "\taddal\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AndOS(Printed);
  InstPrinter->printInst(&And, /*Address=*/0, /*Annot=*/"", *STI, AndOS);
  AndOS.flush();
  EXPECT_EQ(Printed, "\tand\tr1, r2");

  Printed.clear();
  raw_string_ostream AndhOS(Printed);
  InstPrinter->printInst(&Andh, /*Address=*/0, /*Annot=*/"", *STI, AndhOS);
  AndhOS.flush();
  EXPECT_EQ(Printed, "\tandh\tr1, 1");

  Printed.clear();
  raw_string_ostream AndhCOHOS(Printed);
  InstPrinter->printInst(&AndhCOH, /*Address=*/0, /*Annot=*/"", *STI,
                         AndhCOHOS);
  AndhCOHOS.flush();
  EXPECT_EQ(Printed, "\tandh\tr1, 1, coh");

  Printed.clear();
  raw_string_ostream AndlOS(Printed);
  InstPrinter->printInst(&Andl, /*Address=*/0, /*Annot=*/"", *STI, AndlOS);
  AndlOS.flush();
  EXPECT_EQ(Printed, "\tandl\tr1, 1");

  Printed.clear();
  raw_string_ostream AndlCOHOS(Printed);
  InstPrinter->printInst(&AndlCOH, /*Address=*/0, /*Annot=*/"", *STI,
                         AndlCOHOS);
  AndlCOHOS.flush();
  EXPECT_EQ(Printed, "\tandl\tr1, 1, coh");

  Printed.clear();
  raw_string_ostream AndEqOS(Printed);
  InstPrinter->printInst(&AndEq, /*Address=*/0, /*Annot=*/"", *STI, AndEqOS);
  AndEqOS.flush();
  EXPECT_EQ(Printed, "\tandeq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AndAlOS(Printed);
  InstPrinter->printInst(&AndAl, /*Address=*/0, /*Annot=*/"", *STI, AndAlOS);
  AndAlOS.flush();
  EXPECT_EQ(Printed, "\tandal\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AndnOS(Printed);
  InstPrinter->printInst(&Andn, /*Address=*/0, /*Annot=*/"", *STI, AndnOS);
  AndnOS.flush();
  EXPECT_EQ(Printed, "\tandn\tr1, r2");

  Printed.clear();
  raw_string_ostream AsrOS(Printed);
  InstPrinter->printInst(&Asr, /*Address=*/0, /*Annot=*/"", *STI, AsrOS);
  AsrOS.flush();
  EXPECT_EQ(Printed, "\tasr\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream BldOS(Printed);
  InstPrinter->printInst(&Bld, /*Address=*/0, /*Annot=*/"", *STI, BldOS);
  BldOS.flush();
  EXPECT_EQ(Printed, "\tbld\tr1, 1");

  Printed.clear();
  raw_string_ostream BrevOS(Printed);
  InstPrinter->printInst(&Brev, /*Address=*/0, /*Annot=*/"", *STI, BrevOS);
  BrevOS.flush();
  EXPECT_EQ(Printed, "\tbrev\tr1");

  Printed.clear();
  raw_string_ostream BstOS(Printed);
  InstPrinter->printInst(&Bst, /*Address=*/0, /*Annot=*/"", *STI, BstOS);
  BstOS.flush();
  EXPECT_EQ(Printed, "\tbst\tr1, 1");

  Printed.clear();
  raw_string_ostream CbrOS(Printed);
  InstPrinter->printInst(&Cbr, /*Address=*/0, /*Annot=*/"", *STI, CbrOS);
  CbrOS.flush();
  EXPECT_EQ(Printed, "\tcbr\tr1, 1");

  Printed.clear();
  raw_string_ostream BreakpointOS(Printed);
  InstPrinter->printInst(&Breakpoint, /*Address=*/0, /*Annot=*/"", *STI,
                         BreakpointOS);
  BreakpointOS.flush();
  EXPECT_EQ(Printed, "\tbreakpoint");

