cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream MulImmOS(Printed);
  InstPrinter->printInst(&MulImm, /*Address=*/0, /*Annot=*/"", *STI,
                         MulImmOS);
  MulImmOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream MulOS(Printed);
  InstPrinter->printInst(&Mul, /*Address=*/0, /*Annot=*/"", *STI, MulOS);
  MulOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MulsDOS(Printed);
  InstPrinter->printInst(&MulsD, /*Address=*/0, /*Annot=*/"", *STI, MulsDOS);
  MulsDOS.flush();
  EXPECT_EQ(Printed, "\tmuls.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MuluDOS(Printed);
  InstPrinter->printInst(&MuluD, /*Address=*/0, /*Annot=*/"", *STI, MuluDOS);
  MuluDOS.flush();
  EXPECT_EQ(Printed, "\tmulu.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream DivsOS(Printed);
  InstPrinter->printInst(&Divs, /*Address=*/0, /*Annot=*/"", *STI, DivsOS);
  DivsOS.flush();
  EXPECT_EQ(Printed, "\tdivs\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream DivuOS(Printed);
  InstPrinter->printInst(&Divu, /*Address=*/0, /*Annot=*/"", *STI, DivuOS);
  DivuOS.flush();
  EXPECT_EQ(Printed, "\tdivu\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MusfrOS(Printed);
  InstPrinter->printInst(&Musfr, /*Address=*/0, /*Annot=*/"", *STI, MusfrOS);
  MusfrOS.flush();
  EXPECT_EQ(Printed, "\tmusfr\tr1");

  Printed.clear();
  raw_string_ostream MustrOS(Printed);
  InstPrinter->printInst(&Mustr, /*Address=*/0, /*Annot=*/"", *STI, MustrOS);
  MustrOS.flush();
  EXPECT_EQ(Printed, "\tmustr\tr1");

  Printed.clear();
  raw_string_ostream MtdrOS(Printed);
  InstPrinter->printInst(&Mtdr, /*Address=*/0, /*Annot=*/"", *STI, MtdrOS);
  MtdrOS.flush();
  EXPECT_EQ(Printed, "\tmtdr\t4, r1");

  Printed.clear();
  raw_string_ostream MtsrOS(Printed);
  InstPrinter->printInst(&Mtsr, /*Address=*/0, /*Annot=*/"", *STI, MtsrOS);
  MtsrOS.flush();
  EXPECT_EQ(Printed, "\tmtsr\t4, r1");

  Printed.clear();
  raw_string_ostream OrOS(Printed);
  InstPrinter->printInst(&Or, /*Address=*/0, /*Annot=*/"", *STI, OrOS);
  OrOS.flush();
  EXPECT_EQ(Printed, "\tor\tr1, r2");

  Printed.clear();
  raw_string_ostream OrhOS(Printed);
  InstPrinter->printInst(&Orh, /*Address=*/0, /*Annot=*/"", *STI, OrhOS);
  OrhOS.flush();
  EXPECT_EQ(Printed, "\torh\tr1, 1");

  Printed.clear();
  raw_string_ostream OrlOS(Printed);
  InstPrinter->printInst(&Orl, /*Address=*/0, /*Annot=*/"", *STI, OrlOS);
  OrlOS.flush();
  EXPECT_EQ(Printed, "\torl\tr1, 1");

  Printed.clear();
  raw_string_ostream OrEqOS(Printed);
  InstPrinter->printInst(&OrEq, /*Address=*/0, /*Annot=*/"", *STI, OrEqOS);
  OrEqOS.flush();
  EXPECT_EQ(Printed, "\toreq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream OrAlOS(Printed);
  InstPrinter->printInst(&OrAl, /*Address=*/0, /*Annot=*/"", *STI, OrAlOS);
  OrAlOS.flush();
  EXPECT_EQ(Printed, "\toral\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PopjcOS(Printed);
  InstPrinter->printInst(&Popjc, /*Address=*/0, /*Annot=*/"", *STI, PopjcOS);
  PopjcOS.flush();
  EXPECT_EQ(Printed, "\tpopjc");

  Printed.clear();
  raw_string_ostream PushjcOS(Printed);
  InstPrinter->printInst(&Pushjc, /*Address=*/0, /*Annot=*/"", *STI,
                         PushjcOS);
  PushjcOS.flush();
  EXPECT_EQ(Printed, "\tpushjc");

  Printed.clear();
  raw_string_ostream RetdOS(Printed);
  InstPrinter->printInst(&Retd, /*Address=*/0, /*Annot=*/"", *STI, RetdOS);
  RetdOS.flush();
  EXPECT_EQ(Printed, "\tretd");

  Printed.clear();
  raw_string_ostream ReteOS(Printed);
  InstPrinter->printInst(&Rete, /*Address=*/0, /*Annot=*/"", *STI, ReteOS);
  ReteOS.flush();
  EXPECT_EQ(Printed, "\trete");

  Printed.clear();
  raw_string_ostream RetalOS(Printed);
  InstPrinter->printInst(&Retal, /*Address=*/0, /*Annot=*/"", *STI, RetalOS);
  RetalOS.flush();
  EXPECT_EQ(Printed, "\tretal\tlr");

  Printed.clear();
  raw_string_ostream RetccOS(Printed);
  InstPrinter->printInst(&Retcc, /*Address=*/0, /*Annot=*/"", *STI, RetccOS);
  RetccOS.flush();
  EXPECT_EQ(Printed, "\tretcc\tlr");

  Printed.clear();
  raw_string_ostream RetcsOS(Printed);
  InstPrinter->printInst(&Retcs, /*Address=*/0, /*Annot=*/"", *STI, RetcsOS);
  RetcsOS.flush();
  EXPECT_EQ(Printed, "\tretcs\tlr");

  Printed.clear();
  raw_string_ostream RetloOS(Printed);
  InstPrinter->printInst(&Retlo, /*Address=*/0, /*Annot=*/"", *STI, RetloOS);
  RetloOS.flush();
  EXPECT_EQ(Printed, "\tretlo\tlr");

  Printed.clear();
  raw_string_ostream RetgeOS(Printed);
  InstPrinter->printInst(&Retge, /*Address=*/0, /*Annot=*/"", *STI, RetgeOS);
  RetgeOS.flush();
  EXPECT_EQ(Printed, "\tretge\tlr");

  Printed.clear();
  raw_string_ostream RetltOS(Printed);
  InstPrinter->printInst(&Retlt, /*Address=*/0, /*Annot=*/"", *STI, RetltOS);
  RetltOS.flush();
  EXPECT_EQ(Printed, "\tretlt\tlr");

  Printed.clear();
  raw_string_ostream RetmiOS(Printed);
  InstPrinter->printInst(&Retmi, /*Address=*/0, /*Annot=*/"", *STI, RetmiOS);
  RetmiOS.flush();
  EXPECT_EQ(Printed, "\tretmi\tlr");

  Printed.clear();
  raw_string_ostream RetplOS(Printed);
  InstPrinter->printInst(&Retpl, /*Address=*/0, /*Annot=*/"", *STI, RetplOS);
  RetplOS.flush();
  EXPECT_EQ(Printed, "\tretpl\tlr");

  Printed.clear();
  raw_string_ostream RetlsOS(Printed);
  InstPrinter->printInst(&Retls, /*Address=*/0, /*Annot=*/"", *STI, RetlsOS);
  RetlsOS.flush();
  EXPECT_EQ(Printed, "\tretls\tlr");

  Printed.clear();
  raw_string_ostream RetgtOS(Printed);
  InstPrinter->printInst(&Retgt, /*Address=*/0, /*Annot=*/"", *STI, RetgtOS);
  RetgtOS.flush();
  EXPECT_EQ(Printed, "\tretgt\tlr");

  Printed.clear();
  raw_string_ostream RetleOS(Printed);
  InstPrinter->printInst(&Retle, /*Address=*/0, /*Annot=*/"", *STI, RetleOS);
  RetleOS.flush();
  EXPECT_EQ(Printed, "\tretle\tlr");

  Printed.clear();
  raw_string_ostream RethiOS(Printed);
  InstPrinter->printInst(&Rethi, /*Address=*/0, /*Annot=*/"", *STI, RethiOS);
  RethiOS.flush();
  EXPECT_EQ(Printed, "\trethi\tlr");

