cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCContext SubRegImmParseCtx(TT, *MAI, *MRI, *STI, &SubRegImmSrcMgr);
  std::unique_ptr<MCObjectFileInfo> SubRegImmMOFI(
      TheTarget->createMCObjectFileInfo(SubRegImmParseCtx, /*PIC=*/false));
  SubRegImmParseCtx.setObjectFileInfo(SubRegImmMOFI.get());

  std::unique_ptr<MCStreamer> SubRegImmStreamer(
      TheTarget->createNullStreamer(SubRegImmParseCtx));
  std::unique_ptr<MCAsmParser> SubRegImmParser(createMCAsmParser(
      SubRegImmSrcMgr, SubRegImmParseCtx, *SubRegImmStreamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> SubRegImmTargetParser(
      TheTarget->createMCAsmParser(*STI, *SubRegImmParser, *MII));
  ASSERT_NE(SubRegImmTargetParser.get(), nullptr);
  SubRegImmParser->setTargetParser(*SubRegImmTargetParser);
  EXPECT_FALSE(SubRegImmParser->Run(/*NoInitialTextSection=*/false));

  SourceMgr StoreSrcMgr;
  StoreSrcMgr.AddNewSourceBuffer(
      MemoryBuffer::getMemBuffer(
          "st.b r1++, r2\nst.b --r1, r2\nst.b r1[3], r2\n"
          "st.b r1[-1], r2\nst.b r1[r2 << 3], r4\n"
          "st.beq r1[3], r2\nst.bal r1[3], r2\n"
          "st.d r1++, r2\nst.d --r1, r2\nst.d r1, r2\n"
          "st.d r1[-1], r2\nst.d r1[r2 << 3], r4\n"
          "st.h r1++, r2\nst.h --r1, r2\nst.h r1[6], r2\n"
          "st.h r1[-1], r2\nst.h r1[r2 << 3], r4\n"
          "st.heq r1[6], r2\nst.hal r1[6], r2\n"
          "st.w r1++, r2\nst.w --r1, r2\nst.w r1[12], r2\n"
          "st.w r1[-1], r2\nst.w r1[r2 << 3], r4\n"
          "st.weq r1[12], r2\nst.wal r1[12], r2\n"
          "stcond r1[-1], r2\nstdsp sp[12], r2\n"
          "sthh.w r1[12], r2:t, r3:b\n"
          "sthh.w r1[r4 << 3], r2:t, r3:b\n"
          "stswp.h r1[-2], r2\nstswp.w r1[-4], r2\n"),
      SMLoc());

  MCContext StoreParseCtx(TT, *MAI, *MRI, *STI, &StoreSrcMgr);
  std::unique_ptr<MCObjectFileInfo> StoreMOFI(
      TheTarget->createMCObjectFileInfo(StoreParseCtx, /*PIC=*/false));
  StoreParseCtx.setObjectFileInfo(StoreMOFI.get());

  std::unique_ptr<MCStreamer> StoreStreamer(
      TheTarget->createNullStreamer(StoreParseCtx));
  std::unique_ptr<MCAsmParser> StoreParser(
      createMCAsmParser(StoreSrcMgr, StoreParseCtx, *StoreStreamer, *MAI));
  std::unique_ptr<MCTargetAsmParser> StoreTargetParser(
      TheTarget->createMCAsmParser(*STI, *StoreParser, *MII));
  ASSERT_NE(StoreTargetParser.get(), nullptr);
  StoreParser->setTargetParser(*StoreTargetParser);
  EXPECT_FALSE(StoreParser->Run(/*NoInitialTextSection=*/false));
}

} // namespace
